Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/how_health_is_organised/health_boards_and_community_welfare_officers.html.txt.tmx
Source language: en
Languages: ga

source: Administration of the Supplementary Welfare Allowance Scheme
ga: Riar na Scéime Liúntais Leasa Fhorlíontaigh

source: The Department of Social Protection's representatives, formerly known as Community Welfare Officers (CWOs), are employed throughout Ireland by the Department of Social Protection
ga: Tá ionadaithe na Roinne Coimirce Sóisialaí (tugadh Oifigigh Leasa Pobail (CWOanna) orthu roimhe seo) fostaithe ar fud na hÉireann ag an Roinn Coimirce Sóisialaí

source: CWOs were previously employed by the Health Service Executive (HSE)
ga: Bhíodh CWOanna fostaithe ag Feidhmeannacht na Seirbhíse Sláinte (HSE)

source: They are based in health centres or DSP offices and are responsible for the day-to-day administration of the Supplementary Welfare Allowance Scheme
ga: Tá siad bunaithe in ionaid sláinte nó in oifigí DSP agus tá siad freagrach as riar laethúil na Scéime Liúntais Leasa Fhorlíontaigh

source: Supplementary Welfare Allowance Scheme
ga: An Scéim Liúntais Leasa Fhorlíontaigh

source: The Supplementary Welfare Allowance Scheme is funded and legislated for by the Department of Social Protection
ga: Déanann an Roinn Coimirce Sóisialaí an Scéim Liúntais Leasa Fhorlíontaigh a chistiú mar aon le reachtaíocht a rith di

source: The payments made under this scheme include: weekly Supplementary Welfare Allowance, Rent Supplement, Mortgage Interest Supplement, Diet and Heating Supplements, Back to School Clothing and Footwear Scheme and exceptional needs payments for items such as buggies, clothing, etc
ga: I measc na n-íocaíochtaí a dhéantar faoin scéim tá: an Liúntas Leasa Forlíontach seachtainiúil, Forlíonadh Cíosa, Forlíonadh Ús Morgáiste, Forlíonta Aiste Bia agus Téimh, an Scéim Liúntais Éadaí agus Coisbhirt chun Filleadh ar Scoil agus íocaíochtaí ar riachtanais eisceachtúla d’earraí ar nós bugaithe, eadaí, etc

source: Department of Social Protection (DSP) staff are responsible for assessing the income of a person applying for payments under the Supplementary Welfare Allowance Scheme
ga: Tá foireann na Roinne Coimirce Sóisialaí (DSP) freagrach as measúnú a dhéanamh ar ioncam duine a chuireann isteach ar íocaíochtaí faoin Scéim Liúntais Leasa Fhorlíontaigh

source: This assessment may involve home visits to verify a person's place of residence for Rent Supplement purposes or simply to interview someone in surroundings that are more comfortable if he or she has special needs or is unable to visit his or her local health centre in person
ga: D’fhéadfadh cuairteanna ar an mbaile bheith i gceist leis an measúnú seo d’fhonn áit chónaithe duine a dhearbhú do chuspóirí Forlíonadh Cíosa nó go simplí, d'fhonn agallamh a chur ar dhuine i dtimpeallacht atá níos compordaí má tá aige nó aici riachtanais speisialta nó murar féidir leis nó léi cuairt a thabhairt ar a (h)ionad sláinte áitiúil iad féin

source: DSP staff will actively refer individuals to other state agencies and/or voluntary organisations if these are appropriate to the client's needs
ga: Déanfaidh foireann an DSP daoine a atreorú go gníomhach chuig gníomhaireachtaí eile stáit agus/nó chuig eagraíochtaí deonacha má theastaíonn seo de bharr riachtanais an chliaint

source: For example, you may be referred to the Money Advice and Budgeting Service (MABS)
ga: Mar shampla, d’fhéadfaí thú a atreorú chuig an tSeirbhís Bhuiséadta agus Chomhairle Airgid (MABS)

source: Decisions made by DSP staff
ga: Cinntí a dhéanann foireann an DSP

source: DSP staff (designated persons) make decisions about applications under the Supplementary Welfare Allowance Scheme
ga: Déanann foireann an DSP cinntí faoi iarratais a dhéantar faoin Scéim Liúntais Leasa Fhorlíontaigh

source: While they make the decision, they may consult their immediate manager
ga: Fad a dhéanann siad an cinneadh, féadfaidh siad dul i gcomhairle lena mbainisteoir láithreach

source: If you are unhappy with a decision made made by a designated person, you may appeal the decision
ga: Mura bhfuil tú sásta le cinneadh a rinne ball foirne den DSP, féadfaidh tú an cinneadh a achomharc

source: If your appeal concerns a payment of basic Supplementary Welfare Allowance, Mortgage or Rent Supplement, you have a right to have your appeal heard by the Social Welfare Appeals Office
ga: Má bhaineann d’achomharc le híocaíocht Liúntais Leasa Fhorlíontaigh, Forlíonadh Morgáiste nó Cíosa bhunúsaigh, tá sé de cheart agat go n-éisteoidh an Bord Acomharc Leasa Shóisialaigh le d’achomharc

source: Discretionary payments such as Exceptional Needs Payments cannot be appealed to the Social Welfare Appeals Office but they can be reviewed by another staff member on request
ga: Ní féidir íocaíochtaí lánroghnacha, ar nós Íocaíochtaí ar Riachtanais Eisceachtúla, a achomharc leis an Oifig Achomharc Leasa Shóisialaigh, ach is féidir le ball eile foirne athbhreithniú a dhéanamh orthu ar iarraidh sin

source: There is no charge for making an appeal against a decision of a designated person
ga: Níl aon táille le híoc as achomharc a dhéanamh i leith cinneadh a dhéanann ball foirne den DSP

source: There is also no charge for appealing a decision to the Office of the Ombudsman or to the Social Welfare Appeals Office
ga: Ina theannta sin, níl aon táille le híoc as cinneadh a achomharc le hOifig an Ombudsman nó leis an Oifig Achomharc Leasa Shóisialaigh

source: You should contact the Department of Social Protection's representative (formerly the Community Welfare Officer) at your local health centre or DSP office
ga: Ba cheart duit teagmháil a dhéanamh le hionadaí na Roinne Coimirce Sóisialaí (tugadh an tOifigeach Leasa Pobail orthu roimhe seo) ag d’ionad sláinte nó d’oifig DSP áitiúil
